app/controllers/flashcards_controller.rb

SELECT "flashcards".* FROM "flashcards"
---
  def index
    @flashcard = Flashcard.all

INSERT INTO "flashcards" ("original", "translation", "created_at", "updated_at", "note") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["original", "Test"], ["translation", "Test"], ["created_at", "2018-04-27 14:58:46.162613"], ["updated_at", "2018-04-27 14:58:46.162613"], ["note", "Note"]]
---
  def create
    @flashcard = Flashcard.create(flashcard_params)

UPDATE "flashcards" SET "original" = $1, "translation" = $2, "note" = $3, "updated_at" = $4 WHERE "flashcards"."id" = $5  [["original", "Ngor giu Julian"], ["translation", "My name is Julian"], ["note", "Julian Ng"], ["updated_at", "2018-04-27 16:13:19.494847"], ["id", 14]]
---
  def update
    if @flashcard.update(flashcard_params)

DELETE FROM "flashcards" WHERE "flashcards"."id" = $1  [["id", 8]]
---
  def destroy
    @flashcard.destroy

SELECT  "flashcards".* FROM "flashcards" WHERE "flashcards"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def find_flashcard
    @flashcard = Flashcard.find(params[:id])