app/controllers/practices_controller.rb

INSERT INTO "practices" ("session_id", "translation_input", "created_at", "updated_at", "flashcard_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["session_id", 1], ["translation_input", "hello"], ["created_at", "2018-04-28 17:26:50.946665"], ["updated_at", "2018-04-28 17:26:50.946665"], ["flashcard_id", 6]]
---
  def create
    call_random
    @practice = Practice.create(practice_params.merge(session_id: @session_id, flashcard_id: @flashcard.id))

SELECT  "practices".* FROM "practices" WHERE "practices"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def find_practice
    @practice = Practice.find(params[:id])

SELECT  "flashcards".* FROM "flashcards" WHERE "flashcards"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def find_flashcard
    @flashcard = Flashcard.find(@practice.flashcard_id)